TITLE ЛР_1 
;------------------------------------------------------------------------------
;ЛР  №1.1
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                2
; Група:       IT-91
;------------------------------------------------------------------------------
; Автор:        Терентьєв Г.В., Тонкошкур О.Р., Ткаченко В.В.
; Дата:         01/09/2020
;---------------------------------
				;I.ЗАГОЛОВОК ПРОГРАМИ
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
				;II.МАКРОСИ
				;III.ПОЧАТОК СЕГ arr_rnd1МЕНТУ ДАНИХ
DATASEG
exCode db 0
;Рядки символів для виводу на екран
messageHlib db "Hlib Terentyev",10,13,'$'
messageOleh db "Oleh Tonkoshkur", 10,13,'$'
messageViktor db "Viktor Tkachenko",10,13,'$'
				;VI. ПОЧАТОК СЕГМЕНТУ КОДУ
CODESEG
Start:
;---------------------------- 1. Ініціалізація DS і ES-----------------------------------
	mov ax,@data	; @data ідентифікатор, що створюються директивою model
	mov ds, ax	; Завантаження початку сегменту даних в регістр ds
	mov es, ax	; Завантаження початку сегменту даних в регістр es
;------------------------------2. Операція виводу на консоль-------------------------------

        xor cx,cx   ; функція xor обнуляє значення записане в регістрі сх
loop1:              ; прапорець безумовного переходу
       
	 ;вивід першого повідомлення
        mov dx, offset messageHlib
	call print	;виклик процедури print
        ;вивід другого повідомлення
        mov dx, offset messageOleh
	call print
	;вивід третього повідомлення
        mov dx, offset messageViktor
	call print

        inc cx      ; функцією інкременту збільшуємо значення регістру

        cmp cx,3    ; порівнюємо значення регістру з заданим числом

        jle loop1   ; функція умовного переходу виконується якщо перший операнд
		    ; cmp менше рівний другого операнду
	 	    ; при цій умові виконується функція безумовного переходу 

	

;------------------------3. Операція зупинки програми, очікування натискання клавіш-----
	mov ah,01h
			; Завантаження числа 01h до регістру ah
			; (Функція DOS 1h - команда очікування натискання клавіші...)
	int 21h		; Виклик функції DOS 1h
			; Завантаження числа 4ch до регістру ah
			; (Функція DOS 4ch - виходу з програми)
;-----------------------4. Вихід з програми-------------------------------------------
	mov ah,4ch
	mov al,[exCode]	; отримання коду виходу 
	int 21h		; виклик функції DOS 4ch
	end Start
;----------------------5. Використані процедури-------------------------------
print PROC NEAR         ; декларація процедури
        mov ah, 09h ; Завантаження числа 09h до регістру ah
        int 21h     ; Виклик функції DOS 9h
RET                 ; повернення до операціної системи
print ENDP          ; кінець процедури
