TITLE ЛР_1 
;------------------------------------------------------------------------------
;ЛР  №1.1
;------------------------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:              
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:         2
; Група:        IT-91
;------------------------------------------------------------------------------
; Автор:        Терентьєв Г.В., Тонкошкур О.Р., Ткаченко В.В.
; Дата:         08/09/2020
;--------------------------------- 

;---------------------------ЗАГОЛОВОК ПРОГРАМИ------------------

	IDEAL	; Директива - тип Асемблера tasm
	MODEL small	; Директива - тип моделі пам'яті
	STACK 256	; Директива - розмір стеку в байтах

;---------------------------МАКРОСИ-----------------------------
; макрос для ініціалізації
MACRO M_Init ; Початок макросу
	mov ax,@data ; ax <- @data
	mov ds,ax ; ds <- ax
	mov es,ax ; es <- ax
ENDM M_Init ; Кінець макросу
;---------------------------ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------

	DATASEG
	
exCode db 0

; Одна Лінія прямокутника
line db 00h, 01h, 00h, 02h, 00h, 03h, 00h, 04h, 00h, 05h, 00h, 06h
     db 00h, 07h, 00h, 09h, 00h, 11h, 00h, 12h, 00h, 13h, 00h, 14h
;9F
rect_line 	db 57h,02h,65h,02h,6Ch,02h,63h,02h,6Fh,02h
		db 6Dh,02h,65h,02h,00h,02h,4Eh,02h,65h,02h
		db 6Fh,02h,31h,02h,31h,02h,31h,02h,31h,02h
		db 31h,02h,31h,02h,31h,02h,31h,02h,31h,02h
rect_line_length=$-rect_line
line_len = $-line
;---------------------------ПОЧАТОК СЕГМЕНТУ КОДУ---------------
	CODESEG

Start:
	M_Init

;---------------------------------------------------------------
	mov dx,0 ; Початок виводу прямокутника 
	mov bx,0 ; Лічильник 
@loop:
	mov ax,0B800h ; 1. Сегментна адреса відеопамяті
	mov es,ax ; 2. До ES

	; Налаштування SI,DI и СХ для movsb
	mov di,dx; di <- Початок виводу на екран
	mov si,offset rect_line
	mov cx, rect_line_length ; Число байтів на пересилання
	cld ; DF - вперед
	rep movsb ; Пересилання
	
	add dx,160 ; Зміщення для наступної лінії
	inc bx ; Лічильник рядків прямокутника +1
	cmp bx,10 ; Якщо рядків не 10 продовжити
	jnz @loop

Exit:
	mov ah,04Ch
	mov al,[exCode]	; отримання коду виходу
	int 21h	; виклик функції DOS 4ch
;---------------------------------------------------------------
END Start
;---------------------------------------------------------------
