TITLE lab3_team6
;------------------------------------------------------------------------------
;ЛР No3 ДОСЛІДЖЕННЯ МЕХАНІЗМІВ АДРЕСАЦІЇ АРХІТЕКТУРІ ІА-32 (Х86) У REAL ADRESS MODE

; Архітектура комп'ютера              
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:         2
; Група:        IT-91
;------------------------------------------------------------------------------
; Автор:        Терентьєв Г.В., Тонкошкур О.Р., Ткаченко В.В.
; Дата:         08/09/2020
;------------------------------------------------------------------------------
;----------------I.ЗАГОЛОВОК ПРОГРАМИ------------------------
IDEAL
MODEL SMALL
STACK 512
;-----------------------II.МАКРОСИ--------------------------------------
; Складний макрос для ініціалізації
MACRO M_Init
 ; Початок макросу
mov ax, @data ; ax <- @data
mov ds, ax
 ; ds <- ax
mov es, ax
 ; es <- ax
ENDM M_Init
; Початок макросу для переміщення у масиві
MACRO m_incr
; вхідні si, bx
inc si
add bx, 10h
ENDM m_incr
;--------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------
DATASEG
;Оголошення двовимірного експериментального масиву 16х16
array2Db db 7, 8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8
    db 7, 7 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,7 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,7 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,7 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,7 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,7 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,7 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,7 ,0 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7 ,0 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7 ,0 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7 ,0 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7 ,0 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7 ,0 ,7
	db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7 ,7
	db 7, 8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8

exCode DB 0
CODESEG
;----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------
Start:
M_Init

mov bx, 60h ; Готуємо базовий регістр, пересування по вертикалі
mov si, 0h ;Готуємо індексний регістр, пересування по горізонт.
;V - 56  H - 48  O - 4F  T - 54  R - 52
;Terentiev H.V.
mov [array2Db+si+bx], 54h ;M(DS*16+ array2Db+SI+BX)
m_incr
mov [array2Db+si+bx], 48h
m_incr
mov [array2Db+si+bx], 56h
m_incr
;Tkachenko V.V.
mov [array2Db+si+bx], 54h
m_incr
mov [array2Db+si+bx], 56h
m_incr
mov [array2Db+si+bx], 56h
m_incr
;Tonkoshkur O.R.
mov [array2Db+si+bx], 54h
m_incr
mov [array2Db+si+bx], 4Fh
m_incr
mov [array2Db+si+bx], 52h
m_incr

Exit:
mov ah, 04ch
mov al, [exCode]
int 21h

END Start




